#1)გადაიწერეთ ეს კოდი და დეტალურად ახსენით კომენტარებით რას შვება თიოთოეული ხაზი
#password="secretword"
#guess = input()
#while guess != password:
   #guess=input()
#print("access granted ")

#ცვლადის სახელი არი შქმნილი და ანიჭბენ მნიშვნელობას 
#მომხმარებელი შყვანილ მიღებულ მნიშვნელობას ინახავს ცვლადში
#ციკლი ხელახლა ითხოვს შეყვანას ანუ კომპიუტერი თავიდან კითხულობს
#როცა დაემთხვევა ამ დროს მთავრდება და იბეჭდება access granted


#2)მომხარებელს შემოატანინიე რიცხვი input ით, და თუ ეს რიცხვი მეტია 3 ზე დაწეროს "GOA", თუ 3 ზე ნაკლებია დაწეროს "AOG
if 4 > 3:
    print("GOA")
else:
    print("AOG")
