#შექმენი for loop, for loop მა უნდა გამოიტანოს 1 დან 10 მდე მხოლოდ კენტი რიცხვები, ასევე ახსენი რა არის range რა არის step  და რა არის საიტერაციო ცვლადი
for i in range(1,10+1,2):
    print(i)
#step==ნაბიჯი
#range==დიაპაზონი/რიცხვების თანმიმდევრობა
#საიტერაციო ცვლადი==იგივე გამეორება



# შექმენით for loop, for loop ის მეშვეობით გამოიტანე 100 ჯერ GOA Best! ოღონდ ისე რომ მარცხნივ შეგეძლოს წაიკითხო მერამდენე GOA Best! არის ,         მაგ: 21 GOA Best! 
for i in range(101):
    print(i,"gos is best")

#მომხამრებელს შემოატანინეთ 10 რიცხვი ნებისმიერი რიცხვი input ების მეშვეობით და გამოიყენე for loop-ი, (შეგიძლია გამოიყენო მხოლოდ 1 input) 
for i in range (1, 11):
 num = int(input("enter your num:"))
print(num)
